export interface JobDetail {
    id: number;
    title: string;
    posted_date: string;
    company: string;
    representative: string;
    content: string;
    contact: string;
  }
  
  export const dummyJobDetail: JobDetail = {
    id: 745843,
    title: "급구 주간고정 2주2교대 야간고정 남자4명 여자2명 모집 아파트기숙사 무상지원 충북 음성",
    posted_date: "10-17",
    company: "주식회사 사람들",
    representative: "박단승",
    content: `!!!!!!!! 꾸준히 장기 근무가 가능하신분만 지원 부탁드립니다 !!!!!!!<br>
  ~~ 급구 아파트 기숙사 지원 "충북 음성" 남자 여자 2주2교대 + 주간고정 + 야간고정 모집중 ~~<br>
  **** 아래 글 잘 읽어보시고 지원 부탁드립니다 ****<br>
  ~~ 전화 접수 후 경기도 시흥 정왕동 사무실 방문 면접 진행 ~~<br>
  근무지 : 충북 음성 / 경기 시흥 정왕동 1시간~1시간30분 소요 거리<br>
  업무 : 치즈스틱, 붕어빵, 밀키드 등 생산 보조 업무 등<br>
  여자 : 붕어빵, 치즈스틱 생산 포장 및 기계 OP업무 등<br>
  남자 : 자재 및 배합팀, 계량업무 등 생산에 필요한 원료 배합 및 기타 제품 관리"<br>
  - 남 여 신체건강하고 책임감 강하고 근태관리 잘 하실수 있는분만 지원 부탁합니다<br>
  *상의 하의 분리형 제전복 착용 및 모자, 마스크, 장화 및 안전화 착용 근무 가능자 "모든복장 회사에서 지원"<br>
  근무시간 : 주간 08시~17시 / 연장 20:00 -> 야간 20:00~05시 / 연장 08:00<br>
  급여 : 매월 15일 "월차+만근수당+위생수당+자차시 유류비 지원"<br>
  남자 시급 11,250원 / 여자 10,625원<br>
  기숙사 : 신축아파트 숙소 무상 지원 / 차량 소지자 우대 및 유류비 지원 / 통근차량 운행<br>
  근무시작일 : 면접 후 바로 입사 진행 가능<br>
  기숙사 지원시 입사 전날 기숙사 입실<br>
  - 이불, 베게, 세면도구 등 및 간단한 생필품 본인 준비<br>
  전화 접수 후 사무실 면접 진행 뒤 입사일 통보 진행 : 사무실 경기도 시흥시 정왕동 경기스마트공고 사거리 근처<br>
  *부재시 "음성 근무 지원" 이라고 문자 남겨주시면 연락드리겠습니다<br>
  담당자 : 010 - 9243 - 6635<br>
  담당자 : 010 - 9243 - 6635`,
    contact: "010-9243-6635"
  };